Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/*
 * Component description for ETH
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-11-16T06:44:02Z */
#ifndef _PIC32CKSG01_ETH_COMPONENT_H_
#define _PIC32CKSG01_ETH_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ETH                                          */
/* ************************************************************************** */

/* -------- ETH_SAB : (ETH Offset: 0x00) (R/W 32) Specific Address Bottom [31:0] Register -------- */
#define ETH_SAB_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAB) Specific Address Bottom [31:0] Register  Reset Value */

#define ETH_SAB_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAB) Specific Address 1 Position */
#define ETH_SAB_ADDR_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_SAB_ADDR_Pos)           /* (ETH_SAB) Specific Address 1 Mask */
#define ETH_SAB_ADDR(value)                   (ETH_SAB_ADDR_Msk & (_UINT32_(value) << ETH_SAB_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAB register */
#define ETH_SAB_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_SAB) Register Mask  */


/* -------- ETH_SAT : (ETH Offset: 0x04) (R/W 32) Specific Address Top [47:32] Register -------- */
#define ETH_SAT_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SAT) Specific Address Top [47:32] Register  Reset Value */

#define ETH_SAT_ADDR_Pos                      _UINT32_(0)                                          /* (ETH_SAT) Specific Address 1 Position */
#define ETH_SAT_ADDR_Msk                      (_UINT32_(0xFFFF) << ETH_SAT_ADDR_Pos)               /* (ETH_SAT) Specific Address 1 Mask */
#define ETH_SAT_ADDR(value)                   (ETH_SAT_ADDR_Msk & (_UINT32_(value) << ETH_SAT_ADDR_Pos)) /* Assigment of value for ADDR in the ETH_SAT register */
#define ETH_SAT_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_SAT) Register Mask  */


/* -------- ETH_CTRLA : (ETH Offset: 0x00) (R/W 32) CTRLA Register -------- */
#define ETH_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_CTRLA) CTRLA Register  Reset Value */

#define ETH_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (ETH_CTRLA) Software Reset Bit Position */
#define ETH_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << ETH_CTRLA_SWRST_Pos)               /* (ETH_CTRLA) Software Reset Bit Mask */
#define ETH_CTRLA_SWRST(value)                (ETH_CTRLA_SWRST_Msk & (_UINT32_(value) << ETH_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the ETH_CTRLA register */
#define ETH_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (ETH_CTRLA) Macro Enable Position */
#define ETH_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << ETH_CTRLA_ENABLE_Pos)              /* (ETH_CTRLA) Macro Enable Mask */
#define ETH_CTRLA_ENABLE(value)               (ETH_CTRLA_ENABLE_Msk & (_UINT32_(value) << ETH_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the ETH_CTRLA register */
#define ETH_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (ETH_CTRLA) Run in standby mode Position */
#define ETH_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << ETH_CTRLA_RUNSTDBY_Pos)            /* (ETH_CTRLA) Run in standby mode Mask */
#define ETH_CTRLA_RUNSTDBY(value)             (ETH_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << ETH_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the ETH_CTRLA register */
#define ETH_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (ETH_CTRLA) Register Mask  */


/* -------- ETH_CTRLB : (ETH Offset: 0x04) (R/W 32) CTRLB Register -------- */
#define ETH_CTRLB_RESETVALUE                  _UINT32_(0xC0)                                       /*  (ETH_CTRLB) CTRLB Register  Reset Value */

#define ETH_CTRLB_GMIIEN_Pos                  _UINT32_(0)                                          /* (ETH_CTRLB) Select GMII/MII mode Position */
#define ETH_CTRLB_GMIIEN_Msk                  (_UINT32_(0x1) << ETH_CTRLB_GMIIEN_Pos)              /* (ETH_CTRLB) Select GMII/MII mode Mask */
#define ETH_CTRLB_GMIIEN(value)               (ETH_CTRLB_GMIIEN_Msk & (_UINT32_(value) << ETH_CTRLB_GMIIEN_Pos)) /* Assigment of value for GMIIEN in the ETH_CTRLB register */
#define ETH_CTRLB_GBITCLKREQ_Pos              _UINT32_(1)                                          /* (ETH_CTRLB) Gigabit clock request Position */
#define ETH_CTRLB_GBITCLKREQ_Msk              (_UINT32_(0x1) << ETH_CTRLB_GBITCLKREQ_Pos)          /* (ETH_CTRLB) Gigabit clock request Mask */
#define ETH_CTRLB_GBITCLKREQ(value)           (ETH_CTRLB_GBITCLKREQ_Msk & (_UINT32_(value) << ETH_CTRLB_GBITCLKREQ_Pos)) /* Assigment of value for GBITCLKREQ in the ETH_CTRLB register */
#define ETH_CTRLB_TSUCLKREQ_Pos               _UINT32_(2)                                          /* (ETH_CTRLB) TSU Clock Request Position */
#define ETH_CTRLB_TSUCLKREQ_Msk               (_UINT32_(0x1) << ETH_CTRLB_TSUCLKREQ_Pos)           /* (ETH_CTRLB) TSU Clock Request Mask */
#define ETH_CTRLB_TSUCLKREQ(value)            (ETH_CTRLB_TSUCLKREQ_Msk & (_UINT32_(value) << ETH_CTRLB_TSUCLKREQ_Pos)) /* Assigment of value for TSUCLKREQ in the ETH_CTRLB register */
#define ETH_CTRLB_TSUMS_Pos                   _UINT32_(5)                                          /* (ETH_CTRLB) Timer Adjust Position */
#define ETH_CTRLB_TSUMS_Msk                   (_UINT32_(0x1) << ETH_CTRLB_TSUMS_Pos)               /* (ETH_CTRLB) Timer Adjust Mask */
#define ETH_CTRLB_TSUMS(value)                (ETH_CTRLB_TSUMS_Msk & (_UINT32_(value) << ETH_CTRLB_TSUMS_Pos)) /* Assigment of value for TSUMS in the ETH_CTRLB register */
#define ETH_CTRLB_TSUINC_Pos                  _UINT32_(6)                                          /* (ETH_CTRLB) Timer Adjust Mode Position */
#define ETH_CTRLB_TSUINC_Msk                  (_UINT32_(0x3) << ETH_CTRLB_TSUINC_Pos)              /* (ETH_CTRLB) Timer Adjust Mode Mask */
#define ETH_CTRLB_TSUINC(value)               (ETH_CTRLB_TSUINC_Msk & (_UINT32_(value) << ETH_CTRLB_TSUINC_Pos)) /* Assigment of value for TSUINC in the ETH_CTRLB register */
#define ETH_CTRLB_Msk                         _UINT32_(0x000000E7)                                 /* (ETH_CTRLB) Register Mask  */


/* -------- ETH_EVCTRL : (ETH Offset: 0x0C) (R/W 32) Event Control Register -------- */
#define ETH_EVCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_EVCTRL) Event Control Register  Reset Value */

#define ETH_EVCTRL_CMPEO_Pos                  _UINT32_(0)                                          /* (ETH_EVCTRL) Compare Event Out enable Position */
#define ETH_EVCTRL_CMPEO_Msk                  (_UINT32_(0x1) << ETH_EVCTRL_CMPEO_Pos)              /* (ETH_EVCTRL) Compare Event Out enable Mask */
#define ETH_EVCTRL_CMPEO(value)               (ETH_EVCTRL_CMPEO_Msk & (_UINT32_(value) << ETH_EVCTRL_CMPEO_Pos)) /* Assigment of value for CMPEO in the ETH_EVCTRL register */
#define ETH_EVCTRL_Msk                        _UINT32_(0x00000001)                                 /* (ETH_EVCTRL) Register Mask  */


/* -------- ETH_SYNCB : (ETH Offset: 0x20) ( R/ 32) Sync Busy Register -------- */
#define ETH_SYNCB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SYNCB) Sync Busy Register  Reset Value */

#define ETH_SYNCB_SWRST_Pos                   _UINT32_(0)                                          /* (ETH_SYNCB) Software Reset Sync Busy Position */
#define ETH_SYNCB_SWRST_Msk                   (_UINT32_(0x1) << ETH_SYNCB_SWRST_Pos)               /* (ETH_SYNCB) Software Reset Sync Busy Mask */
#define ETH_SYNCB_SWRST(value)                (ETH_SYNCB_SWRST_Msk & (_UINT32_(value) << ETH_SYNCB_SWRST_Pos)) /* Assigment of value for SWRST in the ETH_SYNCB register */
#define ETH_SYNCB_ENABLE_Pos                  _UINT32_(1)                                          /* (ETH_SYNCB) Enable Sync Busy Position */
#define ETH_SYNCB_ENABLE_Msk                  (_UINT32_(0x1) << ETH_SYNCB_ENABLE_Pos)              /* (ETH_SYNCB) Enable Sync Busy Mask */
#define ETH_SYNCB_ENABLE(value)               (ETH_SYNCB_ENABLE_Msk & (_UINT32_(value) << ETH_SYNCB_ENABLE_Pos)) /* Assigment of value for ENABLE in the ETH_SYNCB register */
#define ETH_SYNCB_Msk                         _UINT32_(0x00000003)                                 /* (ETH_SYNCB) Register Mask  */


