Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/* -------- ETH_NCR : (ETH Offset: 0x1000) (R/W 32) Network Control Register -------- */
#define ETH_NCR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_NCR) Network Control Register  Reset Value */

#define ETH_NCR_LBL_Pos                       _UINT32_(1)                                          /* (ETH_NCR) Loop Back Local Position */
#define ETH_NCR_LBL_Msk                       (_UINT32_(0x1) << ETH_NCR_LBL_Pos)                   /* (ETH_NCR) Loop Back Local Mask */
#define ETH_NCR_LBL(value)                    (ETH_NCR_LBL_Msk & (_UINT32_(value) << ETH_NCR_LBL_Pos)) /* Assigment of value for LBL in the ETH_NCR register */
#define ETH_NCR_RXEN_Pos                      _UINT32_(2)                                          /* (ETH_NCR) Receive Enable Position */
#define ETH_NCR_RXEN_Msk                      (_UINT32_(0x1) << ETH_NCR_RXEN_Pos)                  /* (ETH_NCR) Receive Enable Mask */
#define ETH_NCR_RXEN(value)                   (ETH_NCR_RXEN_Msk & (_UINT32_(value) << ETH_NCR_RXEN_Pos)) /* Assigment of value for RXEN in the ETH_NCR register */
#define ETH_NCR_TXEN_Pos                      _UINT32_(3)                                          /* (ETH_NCR) Transmit Enable Position */
#define ETH_NCR_TXEN_Msk                      (_UINT32_(0x1) << ETH_NCR_TXEN_Pos)                  /* (ETH_NCR) Transmit Enable Mask */
#define ETH_NCR_TXEN(value)                   (ETH_NCR_TXEN_Msk & (_UINT32_(value) << ETH_NCR_TXEN_Pos)) /* Assigment of value for TXEN in the ETH_NCR register */
#define ETH_NCR_MPE_Pos                       _UINT32_(4)                                          /* (ETH_NCR) Management Port Enable Position */
#define ETH_NCR_MPE_Msk                       (_UINT32_(0x1) << ETH_NCR_MPE_Pos)                   /* (ETH_NCR) Management Port Enable Mask */
#define ETH_NCR_MPE(value)                    (ETH_NCR_MPE_Msk & (_UINT32_(value) << ETH_NCR_MPE_Pos)) /* Assigment of value for MPE in the ETH_NCR register */
#define ETH_NCR_CLRSTAT_Pos                   _UINT32_(5)                                          /* (ETH_NCR) Clear Statistics Registers Position */
#define ETH_NCR_CLRSTAT_Msk                   (_UINT32_(0x1) << ETH_NCR_CLRSTAT_Pos)               /* (ETH_NCR) Clear Statistics Registers Mask */
#define ETH_NCR_CLRSTAT(value)                (ETH_NCR_CLRSTAT_Msk & (_UINT32_(value) << ETH_NCR_CLRSTAT_Pos)) /* Assigment of value for CLRSTAT in the ETH_NCR register */
#define ETH_NCR_INCSTAT_Pos                   _UINT32_(6)                                          /* (ETH_NCR) Increment Statistics Registers Position */
#define ETH_NCR_INCSTAT_Msk                   (_UINT32_(0x1) << ETH_NCR_INCSTAT_Pos)               /* (ETH_NCR) Increment Statistics Registers Mask */
#define ETH_NCR_INCSTAT(value)                (ETH_NCR_INCSTAT_Msk & (_UINT32_(value) << ETH_NCR_INCSTAT_Pos)) /* Assigment of value for INCSTAT in the ETH_NCR register */
#define ETH_NCR_WESTAT_Pos                    _UINT32_(7)                                          /* (ETH_NCR) Write Enable for Statistics Registers Position */
#define ETH_NCR_WESTAT_Msk                    (_UINT32_(0x1) << ETH_NCR_WESTAT_Pos)                /* (ETH_NCR) Write Enable for Statistics Registers Mask */
#define ETH_NCR_WESTAT(value)                 (ETH_NCR_WESTAT_Msk & (_UINT32_(value) << ETH_NCR_WESTAT_Pos)) /* Assigment of value for WESTAT in the ETH_NCR register */
#define ETH_NCR_BP_Pos                        _UINT32_(8)                                          /* (ETH_NCR) Back pressure Position */
#define ETH_NCR_BP_Msk                        (_UINT32_(0x1) << ETH_NCR_BP_Pos)                    /* (ETH_NCR) Back pressure Mask */
#define ETH_NCR_BP(value)                     (ETH_NCR_BP_Msk & (_UINT32_(value) << ETH_NCR_BP_Pos)) /* Assigment of value for BP in the ETH_NCR register */
#define ETH_NCR_TSTART_Pos                    _UINT32_(9)                                          /* (ETH_NCR) Start Transmission Position */
#define ETH_NCR_TSTART_Msk                    (_UINT32_(0x1) << ETH_NCR_TSTART_Pos)                /* (ETH_NCR) Start Transmission Mask */
#define ETH_NCR_TSTART(value)                 (ETH_NCR_TSTART_Msk & (_UINT32_(value) << ETH_NCR_TSTART_Pos)) /* Assigment of value for TSTART in the ETH_NCR register */
#define ETH_NCR_THALT_Pos                     _UINT32_(10)                                         /* (ETH_NCR) Transmit Halt Position */
#define ETH_NCR_THALT_Msk                     (_UINT32_(0x1) << ETH_NCR_THALT_Pos)                 /* (ETH_NCR) Transmit Halt Mask */
#define ETH_NCR_THALT(value)                  (ETH_NCR_THALT_Msk & (_UINT32_(value) << ETH_NCR_THALT_Pos)) /* Assigment of value for THALT in the ETH_NCR register */
#define ETH_NCR_TXPF_Pos                      _UINT32_(11)                                         /* (ETH_NCR) Transmit Pause Frame Position */
#define ETH_NCR_TXPF_Msk                      (_UINT32_(0x1) << ETH_NCR_TXPF_Pos)                  /* (ETH_NCR) Transmit Pause Frame Mask */
#define ETH_NCR_TXPF(value)                   (ETH_NCR_TXPF_Msk & (_UINT32_(value) << ETH_NCR_TXPF_Pos)) /* Assigment of value for TXPF in the ETH_NCR register */
#define ETH_NCR_TXZQPF_Pos                    _UINT32_(12)                                         /* (ETH_NCR) Transmit Zero Quantum Pause Frame Position */
#define ETH_NCR_TXZQPF_Msk                    (_UINT32_(0x1) << ETH_NCR_TXZQPF_Pos)                /* (ETH_NCR) Transmit Zero Quantum Pause Frame Mask */
#define ETH_NCR_TXZQPF(value)                 (ETH_NCR_TXZQPF_Msk & (_UINT32_(value) << ETH_NCR_TXZQPF_Pos)) /* Assigment of value for TXZQPF in the ETH_NCR register */
#define ETH_NCR_SRTSM_Pos                     _UINT32_(15)                                         /* (ETH_NCR) Store Receive Time Stamp to Memory Position */
#define ETH_NCR_SRTSM_Msk                     (_UINT32_(0x1) << ETH_NCR_SRTSM_Pos)                 /* (ETH_NCR) Store Receive Time Stamp to Memory Mask */
#define ETH_NCR_SRTSM(value)                  (ETH_NCR_SRTSM_Msk & (_UINT32_(value) << ETH_NCR_SRTSM_Pos)) /* Assigment of value for SRTSM in the ETH_NCR register */
#define ETH_NCR_ENPBPR_Pos                    _UINT32_(16)                                         /* (ETH_NCR) Enable PFC Priority-based Pause Reception Position */
#define ETH_NCR_ENPBPR_Msk                    (_UINT32_(0x1) << ETH_NCR_ENPBPR_Pos)                /* (ETH_NCR) Enable PFC Priority-based Pause Reception Mask */
#define ETH_NCR_ENPBPR(value)                 (ETH_NCR_ENPBPR_Msk & (_UINT32_(value) << ETH_NCR_ENPBPR_Pos)) /* Assigment of value for ENPBPR in the ETH_NCR register */
#define ETH_NCR_TXPBPF_Pos                    _UINT32_(17)                                         /* (ETH_NCR) Transmit PFC Priority-based Pause Frame Position */
#define ETH_NCR_TXPBPF_Msk                    (_UINT32_(0x1) << ETH_NCR_TXPBPF_Pos)                /* (ETH_NCR) Transmit PFC Priority-based Pause Frame Mask */
#define ETH_NCR_TXPBPF(value)                 (ETH_NCR_TXPBPF_Msk & (_UINT32_(value) << ETH_NCR_TXPBPF_Pos)) /* Assigment of value for TXPBPF in the ETH_NCR register */
#define ETH_NCR_FNP_Pos                       _UINT32_(18)                                         /* (ETH_NCR) Flush Next Packet Position */
#define ETH_NCR_FNP_Msk                       (_UINT32_(0x1) << ETH_NCR_FNP_Pos)                   /* (ETH_NCR) Flush Next Packet Mask */
#define ETH_NCR_FNP(value)                    (ETH_NCR_FNP_Msk & (_UINT32_(value) << ETH_NCR_FNP_Pos)) /* Assigment of value for FNP in the ETH_NCR register */
#define ETH_NCR_LPI_Pos                       _UINT32_(19)                                         /* (ETH_NCR) Low Power Idle Enable Position */
#define ETH_NCR_LPI_Msk                       (_UINT32_(0x1) << ETH_NCR_LPI_Pos)                   /* (ETH_NCR) Low Power Idle Enable Mask */
#define ETH_NCR_LPI(value)                    (ETH_NCR_LPI_Msk & (_UINT32_(value) << ETH_NCR_LPI_Pos)) /* Assigment of value for LPI in the ETH_NCR register */
#define ETH_NCR_Msk                           _UINT32_(0x000F9FFE)                                 /* (ETH_NCR) Register Mask  */


