Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/* -------- ETH_NCFGR : (ETH Offset: 0x1004) (R/W 32) Network Configuration Register -------- */
#define ETH_NCFGR_RESETVALUE                  _UINT32_(0x80000)                                    /*  (ETH_NCFGR) Network Configuration Register  Reset Value */

#define ETH_NCFGR_SPD_Pos                     _UINT32_(0)                                          /* (ETH_NCFGR) Speed Position */
#define ETH_NCFGR_SPD_Msk                     (_UINT32_(0x1) << ETH_NCFGR_SPD_Pos)                 /* (ETH_NCFGR) Speed Mask */
#define ETH_NCFGR_SPD(value)                  (ETH_NCFGR_SPD_Msk & (_UINT32_(value) << ETH_NCFGR_SPD_Pos)) /* Assigment of value for SPD in the ETH_NCFGR register */
#define ETH_NCFGR_FD_Pos                      _UINT32_(1)                                          /* (ETH_NCFGR) Full Duplex Position */
#define ETH_NCFGR_FD_Msk                      (_UINT32_(0x1) << ETH_NCFGR_FD_Pos)                  /* (ETH_NCFGR) Full Duplex Mask */
#define ETH_NCFGR_FD(value)                   (ETH_NCFGR_FD_Msk & (_UINT32_(value) << ETH_NCFGR_FD_Pos)) /* Assigment of value for FD in the ETH_NCFGR register */
#define ETH_NCFGR_DNVLAN_Pos                  _UINT32_(2)                                          /* (ETH_NCFGR) Discard Non-VLAN FRAMES Position */
#define ETH_NCFGR_DNVLAN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_DNVLAN_Pos)              /* (ETH_NCFGR) Discard Non-VLAN FRAMES Mask */
#define ETH_NCFGR_DNVLAN(value)               (ETH_NCFGR_DNVLAN_Msk & (_UINT32_(value) << ETH_NCFGR_DNVLAN_Pos)) /* Assigment of value for DNVLAN in the ETH_NCFGR register */
#define ETH_NCFGR_JFRAME_Pos                  _UINT32_(3)                                          /* (ETH_NCFGR) Jumbo Frame Size Position */
#define ETH_NCFGR_JFRAME_Msk                  (_UINT32_(0x1) << ETH_NCFGR_JFRAME_Pos)              /* (ETH_NCFGR) Jumbo Frame Size Mask */
#define ETH_NCFGR_JFRAME(value)               (ETH_NCFGR_JFRAME_Msk & (_UINT32_(value) << ETH_NCFGR_JFRAME_Pos)) /* Assigment of value for JFRAME in the ETH_NCFGR register */
#define ETH_NCFGR_CAF_Pos                     _UINT32_(4)                                          /* (ETH_NCFGR) Copy All Frames Position */
#define ETH_NCFGR_CAF_Msk                     (_UINT32_(0x1) << ETH_NCFGR_CAF_Pos)                 /* (ETH_NCFGR) Copy All Frames Mask */
#define ETH_NCFGR_CAF(value)                  (ETH_NCFGR_CAF_Msk & (_UINT32_(value) << ETH_NCFGR_CAF_Pos)) /* Assigment of value for CAF in the ETH_NCFGR register */
#define ETH_NCFGR_NBC_Pos                     _UINT32_(5)                                          /* (ETH_NCFGR) No Broadcast Position */
#define ETH_NCFGR_NBC_Msk                     (_UINT32_(0x1) << ETH_NCFGR_NBC_Pos)                 /* (ETH_NCFGR) No Broadcast Mask */
#define ETH_NCFGR_NBC(value)                  (ETH_NCFGR_NBC_Msk & (_UINT32_(value) << ETH_NCFGR_NBC_Pos)) /* Assigment of value for NBC in the ETH_NCFGR register */
#define ETH_NCFGR_MTIHEN_Pos                  _UINT32_(6)                                          /* (ETH_NCFGR) Multicast Hash Enable Position */
#define ETH_NCFGR_MTIHEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_MTIHEN_Pos)              /* (ETH_NCFGR) Multicast Hash Enable Mask */
#define ETH_NCFGR_MTIHEN(value)               (ETH_NCFGR_MTIHEN_Msk & (_UINT32_(value) << ETH_NCFGR_MTIHEN_Pos)) /* Assigment of value for MTIHEN in the ETH_NCFGR register */
#define ETH_NCFGR_UNIHEN_Pos                  _UINT32_(7)                                          /* (ETH_NCFGR) Unicast Hash Enable Position */
#define ETH_NCFGR_UNIHEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_UNIHEN_Pos)              /* (ETH_NCFGR) Unicast Hash Enable Mask */
#define ETH_NCFGR_UNIHEN(value)               (ETH_NCFGR_UNIHEN_Msk & (_UINT32_(value) << ETH_NCFGR_UNIHEN_Pos)) /* Assigment of value for UNIHEN in the ETH_NCFGR register */
#define ETH_NCFGR_MAXFS_Pos                   _UINT32_(8)                                          /* (ETH_NCFGR) 1536 Maximum Frame Size Position */
#define ETH_NCFGR_MAXFS_Msk                   (_UINT32_(0x1) << ETH_NCFGR_MAXFS_Pos)               /* (ETH_NCFGR) 1536 Maximum Frame Size Mask */
#define ETH_NCFGR_MAXFS(value)                (ETH_NCFGR_MAXFS_Msk & (_UINT32_(value) << ETH_NCFGR_MAXFS_Pos)) /* Assigment of value for MAXFS in the ETH_NCFGR register */
#define ETH_NCFGR_GIGE_Pos                    _UINT32_(10)                                         /* (ETH_NCFGR) Gigabit mode Enable Position */
#define ETH_NCFGR_GIGE_Msk                    (_UINT32_(0x1) << ETH_NCFGR_GIGE_Pos)                /* (ETH_NCFGR) Gigabit mode Enable Mask */
#define ETH_NCFGR_GIGE(value)                 (ETH_NCFGR_GIGE_Msk & (_UINT32_(value) << ETH_NCFGR_GIGE_Pos)) /* Assigment of value for GIGE in the ETH_NCFGR register */
#define ETH_NCFGR_RTY_Pos                     _UINT32_(12)                                         /* (ETH_NCFGR) Retry Test Position */
#define ETH_NCFGR_RTY_Msk                     (_UINT32_(0x1) << ETH_NCFGR_RTY_Pos)                 /* (ETH_NCFGR) Retry Test Mask */
#define ETH_NCFGR_RTY(value)                  (ETH_NCFGR_RTY_Msk & (_UINT32_(value) << ETH_NCFGR_RTY_Pos)) /* Assigment of value for RTY in the ETH_NCFGR register */
#define ETH_NCFGR_PEN_Pos                     _UINT32_(13)                                         /* (ETH_NCFGR) Pause Enable Position */
#define ETH_NCFGR_PEN_Msk                     (_UINT32_(0x1) << ETH_NCFGR_PEN_Pos)                 /* (ETH_NCFGR) Pause Enable Mask */
#define ETH_NCFGR_PEN(value)                  (ETH_NCFGR_PEN_Msk & (_UINT32_(value) << ETH_NCFGR_PEN_Pos)) /* Assigment of value for PEN in the ETH_NCFGR register */
#define ETH_NCFGR_RXBUFO_Pos                  _UINT32_(14)                                         /* (ETH_NCFGR) Receive Buffer Offset Position */
#define ETH_NCFGR_RXBUFO_Msk                  (_UINT32_(0x3) << ETH_NCFGR_RXBUFO_Pos)              /* (ETH_NCFGR) Receive Buffer Offset Mask */
#define ETH_NCFGR_RXBUFO(value)               (ETH_NCFGR_RXBUFO_Msk & (_UINT32_(value) << ETH_NCFGR_RXBUFO_Pos)) /* Assigment of value for RXBUFO in the ETH_NCFGR register */
#define ETH_NCFGR_LFERD_Pos                   _UINT32_(16)                                         /* (ETH_NCFGR) Length Field Error Frame Discard Position */
#define ETH_NCFGR_LFERD_Msk                   (_UINT32_(0x1) << ETH_NCFGR_LFERD_Pos)               /* (ETH_NCFGR) Length Field Error Frame Discard Mask */
#define ETH_NCFGR_LFERD(value)                (ETH_NCFGR_LFERD_Msk & (_UINT32_(value) << ETH_NCFGR_LFERD_Pos)) /* Assigment of value for LFERD in the ETH_NCFGR register */
#define ETH_NCFGR_RFCS_Pos                    _UINT32_(17)                                         /* (ETH_NCFGR) Remove FCS Position */
#define ETH_NCFGR_RFCS_Msk                    (_UINT32_(0x1) << ETH_NCFGR_RFCS_Pos)                /* (ETH_NCFGR) Remove FCS Mask */
#define ETH_NCFGR_RFCS(value)                 (ETH_NCFGR_RFCS_Msk & (_UINT32_(value) << ETH_NCFGR_RFCS_Pos)) /* Assigment of value for RFCS in the ETH_NCFGR register */
#define ETH_NCFGR_CLK_Pos                     _UINT32_(18)                                         /* (ETH_NCFGR) MDC CLock Division Position */
#define ETH_NCFGR_CLK_Msk                     (_UINT32_(0x7) << ETH_NCFGR_CLK_Pos)                 /* (ETH_NCFGR) MDC CLock Division Mask */
#define ETH_NCFGR_CLK(value)                  (ETH_NCFGR_CLK_Msk & (_UINT32_(value) << ETH_NCFGR_CLK_Pos)) /* Assigment of value for CLK in the ETH_NCFGR register */
#define ETH_NCFGR_DBW_Pos                     _UINT32_(21)                                         /* (ETH_NCFGR) Data Bus Width Position */
#define ETH_NCFGR_DBW_Msk                     (_UINT32_(0x3) << ETH_NCFGR_DBW_Pos)                 /* (ETH_NCFGR) Data Bus Width Mask */
#define ETH_NCFGR_DBW(value)                  (ETH_NCFGR_DBW_Msk & (_UINT32_(value) << ETH_NCFGR_DBW_Pos)) /* Assigment of value for DBW in the ETH_NCFGR register */
#define ETH_NCFGR_DCPF_Pos                    _UINT32_(23)                                         /* (ETH_NCFGR) Disable Copy of Pause Frames Position */
#define ETH_NCFGR_DCPF_Msk                    (_UINT32_(0x1) << ETH_NCFGR_DCPF_Pos)                /* (ETH_NCFGR) Disable Copy of Pause Frames Mask */
#define ETH_NCFGR_DCPF(value)                 (ETH_NCFGR_DCPF_Msk & (_UINT32_(value) << ETH_NCFGR_DCPF_Pos)) /* Assigment of value for DCPF in the ETH_NCFGR register */
#define ETH_NCFGR_RXCOEN_Pos                  _UINT32_(24)                                         /* (ETH_NCFGR) Receive Checksum Offload Enable Position */
#define ETH_NCFGR_RXCOEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_RXCOEN_Pos)              /* (ETH_NCFGR) Receive Checksum Offload Enable Mask */
#define ETH_NCFGR_RXCOEN(value)               (ETH_NCFGR_RXCOEN_Msk & (_UINT32_(value) << ETH_NCFGR_RXCOEN_Pos)) /* Assigment of value for RXCOEN in the ETH_NCFGR register */
#define ETH_NCFGR_EFRHD_Pos                   _UINT32_(25)                                         /* (ETH_NCFGR) Enable Frames Received in Half Duplex Position */
#define ETH_NCFGR_EFRHD_Msk                   (_UINT32_(0x1) << ETH_NCFGR_EFRHD_Pos)               /* (ETH_NCFGR) Enable Frames Received in Half Duplex Mask */
#define ETH_NCFGR_EFRHD(value)                (ETH_NCFGR_EFRHD_Msk & (_UINT32_(value) << ETH_NCFGR_EFRHD_Pos)) /* Assigment of value for EFRHD in the ETH_NCFGR register */
#define ETH_NCFGR_IRXFCS_Pos                  _UINT32_(26)                                         /* (ETH_NCFGR) Ignore RX FCS Position */
#define ETH_NCFGR_IRXFCS_Msk                  (_UINT32_(0x1) << ETH_NCFGR_IRXFCS_Pos)              /* (ETH_NCFGR) Ignore RX FCS Mask */
#define ETH_NCFGR_IRXFCS(value)               (ETH_NCFGR_IRXFCS_Msk & (_UINT32_(value) << ETH_NCFGR_IRXFCS_Pos)) /* Assigment of value for IRXFCS in the ETH_NCFGR register */
#define ETH_NCFGR_IPGSEN_Pos                  _UINT32_(28)                                         /* (ETH_NCFGR) IP Stretch Enable Position */
#define ETH_NCFGR_IPGSEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_IPGSEN_Pos)              /* (ETH_NCFGR) IP Stretch Enable Mask */
#define ETH_NCFGR_IPGSEN(value)               (ETH_NCFGR_IPGSEN_Msk & (_UINT32_(value) << ETH_NCFGR_IPGSEN_Pos)) /* Assigment of value for IPGSEN in the ETH_NCFGR register */
#define ETH_NCFGR_RXBP_Pos                    _UINT32_(29)                                         /* (ETH_NCFGR) Receive Bad Preamble Position */
#define ETH_NCFGR_RXBP_Msk                    (_UINT32_(0x1) << ETH_NCFGR_RXBP_Pos)                /* (ETH_NCFGR) Receive Bad Preamble Mask */
#define ETH_NCFGR_RXBP(value)                 (ETH_NCFGR_RXBP_Msk & (_UINT32_(value) << ETH_NCFGR_RXBP_Pos)) /* Assigment of value for RXBP in the ETH_NCFGR register */
#define ETH_NCFGR_IRXER_Pos                   _UINT32_(30)                                         /* (ETH_NCFGR) Ignore IPG GRXER Position */
#define ETH_NCFGR_IRXER_Msk                   (_UINT32_(0x1) << ETH_NCFGR_IRXER_Pos)               /* (ETH_NCFGR) Ignore IPG GRXER Mask */
#define ETH_NCFGR_IRXER(value)                (ETH_NCFGR_IRXER_Msk & (_UINT32_(value) << ETH_NCFGR_IRXER_Pos)) /* Assigment of value for IRXER in the ETH_NCFGR register */
#define ETH_NCFGR_Msk                         _UINT32_(0x77FFF5FF)                                 /* (ETH_NCFGR) Register Mask  */


/* -------- ETH_NSR : (ETH Offset: 0x1008) ( R/ 32) Network Status Register -------- */
#define ETH_NSR_RESETVALUE                    _UINT32_(0x04)                                       /*  (ETH_NSR) Network Status Register  Reset Value */

#define ETH_NSR_MDIO_Pos                      _UINT32_(1)                                          /* (ETH_NSR) MDIO Input Status Position */
#define ETH_NSR_MDIO_Msk                      (_UINT32_(0x1) << ETH_NSR_MDIO_Pos)                  /* (ETH_NSR) MDIO Input Status Mask */
#define ETH_NSR_MDIO(value)                   (ETH_NSR_MDIO_Msk & (_UINT32_(value) << ETH_NSR_MDIO_Pos)) /* Assigment of value for MDIO in the ETH_NSR register */
#define ETH_NSR_IDLE_Pos                      _UINT32_(2)                                          /* (ETH_NSR) PHY Management Logic Idle Position */
#define ETH_NSR_IDLE_Msk                      (_UINT32_(0x1) << ETH_NSR_IDLE_Pos)                  /* (ETH_NSR) PHY Management Logic Idle Mask */
#define ETH_NSR_IDLE(value)                   (ETH_NSR_IDLE_Msk & (_UINT32_(value) << ETH_NSR_IDLE_Pos)) /* Assigment of value for IDLE in the ETH_NSR register */
#define ETH_NSR_Msk                           _UINT32_(0x00000006)                                 /* (ETH_NSR) Register Mask  */


/* -------- ETH_UR : (ETH Offset: 0x100C) (R/W 32) User Register -------- */
#define ETH_UR_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_UR) User Register  Reset Value */

#define ETH_UR_UO_Pos                         _UINT32_(0)                                          /* (ETH_UR) User Programmable Outputs Position */
#define ETH_UR_UO_Msk                         (_UINT32_(0xFFFF) << ETH_UR_UO_Pos)                  /* (ETH_UR) User Programmable Outputs Mask */
#define ETH_UR_UO(value)                      (ETH_UR_UO_Msk & (_UINT32_(value) << ETH_UR_UO_Pos)) /* Assigment of value for UO in the ETH_UR register */
#define ETH_UR_UI_Pos                         _UINT32_(16)                                         /* (ETH_UR) User Programmable Inputs Position */
#define ETH_UR_UI_Msk                         (_UINT32_(0xFFFF) << ETH_UR_UI_Pos)                  /* (ETH_UR) User Programmable Inputs Mask */
#define ETH_UR_UI(value)                      (ETH_UR_UI_Msk & (_UINT32_(value) << ETH_UR_UI_Pos)) /* Assigment of value for UI in the ETH_UR register */
#define ETH_UR_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (ETH_UR) Register Mask  */


/* -------- ETH_DCFGR : (ETH Offset: 0x1010) (R/W 32) DMA Configuration Register -------- */
#define ETH_DCFGR_RESETVALUE                  _UINT32_(0x20704)                                    /*  (ETH_DCFGR) DMA Configuration Register  Reset Value */

#define ETH_DCFGR_FBLDO_Pos                   _UINT32_(0)                                          /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Position */
#define ETH_DCFGR_FBLDO_Msk                   (_UINT32_(0x1F) << ETH_DCFGR_FBLDO_Pos)              /* (ETH_DCFGR) Fixed Burst Length for DMA Data Operations: Mask */
#define ETH_DCFGR_FBLDO(value)                (ETH_DCFGR_FBLDO_Msk & (_UINT32_(value) << ETH_DCFGR_FBLDO_Pos)) /* Assigment of value for FBLDO in the ETH_DCFGR register */
#define ETH_DCFGR_ESMA_Pos                    _UINT32_(6)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Position */
#define ETH_DCFGR_ESMA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESMA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Management Descriptor Accesses Mask */
#define ETH_DCFGR_ESMA(value)                 (ETH_DCFGR_ESMA_Msk & (_UINT32_(value) << ETH_DCFGR_ESMA_Pos)) /* Assigment of value for ESMA in the ETH_DCFGR register */
#define ETH_DCFGR_ESPA_Pos                    _UINT32_(7)                                          /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Position */
#define ETH_DCFGR_ESPA_Msk                    (_UINT32_(0x1) << ETH_DCFGR_ESPA_Pos)                /* (ETH_DCFGR) Endian Swap Mode Enable for Packet Data Accesses Mask */
#define ETH_DCFGR_ESPA(value)                 (ETH_DCFGR_ESPA_Msk & (_UINT32_(value) << ETH_DCFGR_ESPA_Pos)) /* Assigment of value for ESPA in the ETH_DCFGR register */
#define ETH_DCFGR_RXBMS_Pos                   _UINT32_(8)                                          /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_RXBMS_Msk                   (_UINT32_(0x3) << ETH_DCFGR_RXBMS_Pos)               /* (ETH_DCFGR) Receiver Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_RXBMS(value)                (ETH_DCFGR_RXBMS_Msk & (_UINT32_(value) << ETH_DCFGR_RXBMS_Pos)) /* Assigment of value for RXBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXPBMS_Pos                  _UINT32_(10)                                         /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Position */
#define ETH_DCFGR_TXPBMS_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXPBMS_Pos)              /* (ETH_DCFGR) Transmitter Packet Buffer Memory Size Select Mask */
#define ETH_DCFGR_TXPBMS(value)               (ETH_DCFGR_TXPBMS_Msk & (_UINT32_(value) << ETH_DCFGR_TXPBMS_Pos)) /* Assigment of value for TXPBMS in the ETH_DCFGR register */
#define ETH_DCFGR_TXCOEN_Pos                  _UINT32_(11)                                         /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Position */
#define ETH_DCFGR_TXCOEN_Msk                  (_UINT32_(0x1) << ETH_DCFGR_TXCOEN_Pos)              /* (ETH_DCFGR) Transmitter Checksum Generation Offload Enable Mask */
#define ETH_DCFGR_TXCOEN(value)               (ETH_DCFGR_TXCOEN_Msk & (_UINT32_(value) << ETH_DCFGR_TXCOEN_Pos)) /* Assigment of value for TXCOEN in the ETH_DCFGR register */
#define ETH_DCFGR_DRBS_Pos                    _UINT32_(16)                                         /* (ETH_DCFGR) DMA Receive Buffer Size Position */
#define ETH_DCFGR_DRBS_Msk                    (_UINT32_(0xFF) << ETH_DCFGR_DRBS_Pos)               /* (ETH_DCFGR) DMA Receive Buffer Size Mask */
#define ETH_DCFGR_DRBS(value)                 (ETH_DCFGR_DRBS_Msk & (_UINT32_(value) << ETH_DCFGR_DRBS_Pos)) /* Assigment of value for DRBS in the ETH_DCFGR register */
#define ETH_DCFGR_DDRP_Pos                    _UINT32_(24)                                         /* (ETH_DCFGR) DMA Discard Receive Packets Position */
#define ETH_DCFGR_DDRP_Msk                    (_UINT32_(0x1) << ETH_DCFGR_DDRP_Pos)                /* (ETH_DCFGR) DMA Discard Receive Packets Mask */
#define ETH_DCFGR_DDRP(value)                 (ETH_DCFGR_DDRP_Msk & (_UINT32_(value) << ETH_DCFGR_DDRP_Pos)) /* Assigment of value for DDRP in the ETH_DCFGR register */
#define ETH_DCFGR_Msk                         _UINT32_(0x01FF0FDF)                                 /* (ETH_DCFGR) Register Mask  */


/* -------- ETH_TSR : (ETH Offset: 0x1014) (R/W 32) Transmit Status Register -------- */
#define ETH_TSR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSR) Transmit Status Register  Reset Value */

#define ETH_TSR_UBR_Pos                       _UINT32_(0)                                          /* (ETH_TSR) Used Bit Read Position */
#define ETH_TSR_UBR_Msk                       (_UINT32_(0x1) << ETH_TSR_UBR_Pos)                   /* (ETH_TSR) Used Bit Read Mask */
#define ETH_TSR_UBR(value)                    (ETH_TSR_UBR_Msk & (_UINT32_(value) << ETH_TSR_UBR_Pos)) /* Assigment of value for UBR in the ETH_TSR register */
#define ETH_TSR_COL_Pos                       _UINT32_(1)                                          /* (ETH_TSR) Collision Occurred Position */
#define ETH_TSR_COL_Msk                       (_UINT32_(0x1) << ETH_TSR_COL_Pos)                   /* (ETH_TSR) Collision Occurred Mask */
#define ETH_TSR_COL(value)                    (ETH_TSR_COL_Msk & (_UINT32_(value) << ETH_TSR_COL_Pos)) /* Assigment of value for COL in the ETH_TSR register */
#define ETH_TSR_RLE_Pos                       _UINT32_(2)                                          /* (ETH_TSR) Retry Limit Exceeded Position */
#define ETH_TSR_RLE_Msk                       (_UINT32_(0x1) << ETH_TSR_RLE_Pos)                   /* (ETH_TSR) Retry Limit Exceeded Mask */
#define ETH_TSR_RLE(value)                    (ETH_TSR_RLE_Msk & (_UINT32_(value) << ETH_TSR_RLE_Pos)) /* Assigment of value for RLE in the ETH_TSR register */
#define ETH_TSR_TXGO_Pos                      _UINT32_(3)                                          /* (ETH_TSR) Transmit Go Position */
#define ETH_TSR_TXGO_Msk                      (_UINT32_(0x1) << ETH_TSR_TXGO_Pos)                  /* (ETH_TSR) Transmit Go Mask */
#define ETH_TSR_TXGO(value)                   (ETH_TSR_TXGO_Msk & (_UINT32_(value) << ETH_TSR_TXGO_Pos)) /* Assigment of value for TXGO in the ETH_TSR register */
#define ETH_TSR_TFC_Pos                       _UINT32_(4)                                          /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_TSR_TFC_Msk                       (_UINT32_(0x1) << ETH_TSR_TFC_Pos)                   /* (ETH_TSR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_TSR_TFC(value)                    (ETH_TSR_TFC_Msk & (_UINT32_(value) << ETH_TSR_TFC_Pos)) /* Assigment of value for TFC in the ETH_TSR register */
#define ETH_TSR_TXCOMP_Pos                    _UINT32_(5)                                          /* (ETH_TSR) Transmit Complete Position */
#define ETH_TSR_TXCOMP_Msk                    (_UINT32_(0x1) << ETH_TSR_TXCOMP_Pos)                /* (ETH_TSR) Transmit Complete Mask */
#define ETH_TSR_TXCOMP(value)                 (ETH_TSR_TXCOMP_Msk & (_UINT32_(value) << ETH_TSR_TXCOMP_Pos)) /* Assigment of value for TXCOMP in the ETH_TSR register */
#define ETH_TSR_UND_Pos                       _UINT32_(6)                                          /* (ETH_TSR) Transmit Underrun Position */
#define ETH_TSR_UND_Msk                       (_UINT32_(0x1) << ETH_TSR_UND_Pos)                   /* (ETH_TSR) Transmit Underrun Mask */
#define ETH_TSR_UND(value)                    (ETH_TSR_UND_Msk & (_UINT32_(value) << ETH_TSR_UND_Pos)) /* Assigment of value for UND in the ETH_TSR register */
#define ETH_TSR_LCOL_Pos                      _UINT32_(7)                                          /* (ETH_TSR) Late Colision Occured Position */
#define ETH_TSR_LCOL_Msk                      (_UINT32_(0x1) << ETH_TSR_LCOL_Pos)                  /* (ETH_TSR) Late Colision Occured Mask */
#define ETH_TSR_LCOL(value)                   (ETH_TSR_LCOL_Msk & (_UINT32_(value) << ETH_TSR_LCOL_Pos)) /* Assigment of value for LCOL in the ETH_TSR register */
#define ETH_TSR_HRESP_Pos                     _UINT32_(8)                                          /* (ETH_TSR) HRESP Not OK Position */
#define ETH_TSR_HRESP_Msk                     (_UINT32_(0x1) << ETH_TSR_HRESP_Pos)                 /* (ETH_TSR) HRESP Not OK Mask */
#define ETH_TSR_HRESP(value)                  (ETH_TSR_HRESP_Msk & (_UINT32_(value) << ETH_TSR_HRESP_Pos)) /* Assigment of value for HRESP in the ETH_TSR register */
#define ETH_TSR_Msk                           _UINT32_(0x000001FF)                                 /* (ETH_TSR) Register Mask  */


/* -------- ETH_RBQB : (ETH Offset: 0x1018) (R/W 32) Receive Buffer Queue Base Address -------- */
#define ETH_RBQB_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_RBQB) Receive Buffer Queue Base Address  Reset Value */

