Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/* -------- ETH_SCL : (ETH Offset: 0x10E0) (R/W 32) Tsu timer second comparison Register -------- */
#define ETH_SCL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCL) Tsu timer second comparison Register  Reset Value */

#define ETH_SCL_SEC_Pos                       _UINT32_(0)                                          /* (ETH_SCL) 1588 Timer Second comparison value Position */
#define ETH_SCL_SEC_Msk                       (_UINT32_(0xFFFFFFFF) << ETH_SCL_SEC_Pos)            /* (ETH_SCL) 1588 Timer Second comparison value Mask */
#define ETH_SCL_SEC(value)                    (ETH_SCL_SEC_Msk & (_UINT32_(value) << ETH_SCL_SEC_Pos)) /* Assigment of value for SEC in the ETH_SCL register */
#define ETH_SCL_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_SCL) Register Mask  */


/* -------- ETH_SCH : (ETH Offset: 0x10E4) (R/W 32) Tsu timer second comparison Register -------- */
#define ETH_SCH_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCH) Tsu timer second comparison Register  Reset Value */

#define ETH_SCH_SEC_Pos                       _UINT32_(0)                                          /* (ETH_SCH) 1588 Timer Second comparison value Position */
#define ETH_SCH_SEC_Msk                       (_UINT32_(0xFFFF) << ETH_SCH_SEC_Pos)                /* (ETH_SCH) 1588 Timer Second comparison value Mask */
#define ETH_SCH_SEC(value)                    (ETH_SCH_SEC_Msk & (_UINT32_(value) << ETH_SCH_SEC_Pos)) /* Assigment of value for SEC in the ETH_SCH register */
#define ETH_SCH_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_SCH) Register Mask  */


/* -------- ETH_EFTSH : (ETH Offset: 0x10E8) ( R/ 32) PTP Event Frame Transmitted Seconds High Register -------- */
#define ETH_EFTSH_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFTSH) PTP Event Frame Transmitted Seconds High Register  Reset Value */

#define ETH_EFTSH_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFTSH) Register Update Position */
#define ETH_EFTSH_RUD_Msk                     (_UINT32_(0xFFFF) << ETH_EFTSH_RUD_Pos)              /* (ETH_EFTSH) Register Update Mask */
#define ETH_EFTSH_RUD(value)                  (ETH_EFTSH_RUD_Msk & (_UINT32_(value) << ETH_EFTSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTSH register */
#define ETH_EFTSH_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_EFTSH) Register Mask  */


/* -------- ETH_EFRSH : (ETH Offset: 0x10EC) ( R/ 32) PTP Event Frame Received Seconds High Register -------- */
#define ETH_EFRSH_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFRSH) PTP Event Frame Received Seconds High Register  Reset Value */

#define ETH_EFRSH_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFRSH) Register Update Position */
#define ETH_EFRSH_RUD_Msk                     (_UINT32_(0xFFFF) << ETH_EFRSH_RUD_Pos)              /* (ETH_EFRSH) Register Update Mask */
#define ETH_EFRSH_RUD(value)                  (ETH_EFRSH_RUD_Msk & (_UINT32_(value) << ETH_EFRSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFRSH register */
#define ETH_EFRSH_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_EFRSH) Register Mask  */


/* -------- ETH_PEFTSH : (ETH Offset: 0x10F0) ( R/ 32) PTP Peer Event Frame Transmitted Seconds High Register -------- */
#define ETH_PEFTSH_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFTSH) PTP Peer Event Frame Transmitted Seconds High Register  Reset Value */

#define ETH_PEFTSH_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFTSH) Register Update Position */
#define ETH_PEFTSH_RUD_Msk                    (_UINT32_(0xFFFF) << ETH_PEFTSH_RUD_Pos)             /* (ETH_PEFTSH) Register Update Mask */
#define ETH_PEFTSH_RUD(value)                 (ETH_PEFTSH_RUD_Msk & (_UINT32_(value) << ETH_PEFTSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFTSH register */
#define ETH_PEFTSH_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_PEFTSH) Register Mask  */


/* -------- ETH_PEFRSH : (ETH Offset: 0x10F4) ( R/ 32) PTP Peer Event Frame Received Seconds High Register -------- */
#define ETH_PEFRSH_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFRSH) PTP Peer Event Frame Received Seconds High Register  Reset Value */

#define ETH_PEFRSH_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFRSH) Register Update Position */
#define ETH_PEFRSH_RUD_Msk                    (_UINT32_(0xFFFF) << ETH_PEFRSH_RUD_Pos)             /* (ETH_PEFRSH) Register Update Mask */
#define ETH_PEFRSH_RUD(value)                 (ETH_PEFRSH_RUD_Msk & (_UINT32_(value) << ETH_PEFRSH_RUD_Pos)) /* Assigment of value for RUD in the ETH_PEFRSH register */
#define ETH_PEFRSH_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_PEFRSH) Register Mask  */


/* -------- ETH_OTLO : (ETH Offset: 0x1100) ( R/ 32) Octets Transmitted [31:0] Register -------- */
#define ETH_OTLO_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_OTLO) Octets Transmitted [31:0] Register  Reset Value */

#define ETH_OTLO_TXO_Pos                      _UINT32_(0)                                          /* (ETH_OTLO) Transmitted Octets Position */
#define ETH_OTLO_TXO_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_OTLO_TXO_Pos)           /* (ETH_OTLO) Transmitted Octets Mask */
#define ETH_OTLO_TXO(value)                   (ETH_OTLO_TXO_Msk & (_UINT32_(value) << ETH_OTLO_TXO_Pos)) /* Assigment of value for TXO in the ETH_OTLO register */
#define ETH_OTLO_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_OTLO) Register Mask  */


