Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/* -------- ETH_TBFR127 : (ETH Offset: 0x116C) ( R/ 32) 65 to 127 Byte Frames Received Register -------- */
#define ETH_TBFR127_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR127) 65 to 127 Byte Frames Received Register  Reset Value */

#define ETH_TBFR127_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Position */
#define ETH_TBFR127_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR127_NFRX_Pos)       /* (ETH_TBFR127) 65 to 127 Byte Frames Received without Error Mask */
#define ETH_TBFR127_NFRX(value)               (ETH_TBFR127_NFRX_Msk & (_UINT32_(value) << ETH_TBFR127_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR127 register */
#define ETH_TBFR127_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR127) Register Mask  */


/* -------- ETH_TBFR255 : (ETH Offset: 0x1170) ( R/ 32) 128 to 255 Byte Frames Received Register -------- */
#define ETH_TBFR255_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR255) 128 to 255 Byte Frames Received Register  Reset Value */

#define ETH_TBFR255_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Position */
#define ETH_TBFR255_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR255_NFRX_Pos)       /* (ETH_TBFR255) 128 to 255 Byte Frames Received without Error Mask */
#define ETH_TBFR255_NFRX(value)               (ETH_TBFR255_NFRX_Msk & (_UINT32_(value) << ETH_TBFR255_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR255 register */
#define ETH_TBFR255_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR255) Register Mask  */


/* -------- ETH_TBFR511 : (ETH Offset: 0x1174) ( R/ 32) 256 to 511Byte Frames Received Register -------- */
#define ETH_TBFR511_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_TBFR511) 256 to 511Byte Frames Received Register  Reset Value */

#define ETH_TBFR511_NFRX_Pos                  _UINT32_(0)                                          /* (ETH_TBFR511) 256 to 511 Byte Frames Received without Error Position */
#define ETH_TBFR511_NFRX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFR511_NFRX_Pos)       /* (ETH_TBFR511) 256 to 511 Byte Frames Received without Error Mask */
#define ETH_TBFR511_NFRX(value)               (ETH_TBFR511_NFRX_Msk & (_UINT32_(value) << ETH_TBFR511_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR511 register */
#define ETH_TBFR511_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR511) Register Mask  */


/* -------- ETH_TBFR1023 : (ETH Offset: 0x1178) ( R/ 32) 512 to 1023 Byte Frames Received Register -------- */
#define ETH_TBFR1023_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFR1023) 512 to 1023 Byte Frames Received Register  Reset Value */

#define ETH_TBFR1023_NFRX_Pos                 _UINT32_(0)                                          /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received without Error Position */
#define ETH_TBFR1023_NFRX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFR1023_NFRX_Pos)      /* (ETH_TBFR1023) 512 to 1023 Byte Frames Received without Error Mask */
#define ETH_TBFR1023_NFRX(value)              (ETH_TBFR1023_NFRX_Msk & (_UINT32_(value) << ETH_TBFR1023_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR1023 register */
#define ETH_TBFR1023_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR1023) Register Mask  */


/* -------- ETH_TBFR1518 : (ETH Offset: 0x117C) ( R/ 32) 1024 to 1518 Byte Frames Received Register -------- */
#define ETH_TBFR1518_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFR1518) 1024 to 1518 Byte Frames Received Register  Reset Value */

#define ETH_TBFR1518_NFRX_Pos                 _UINT32_(0)                                          /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received without Error Position */
#define ETH_TBFR1518_NFRX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFR1518_NFRX_Pos)      /* (ETH_TBFR1518) 1024 to 1518 Byte Frames Received without Error Mask */
#define ETH_TBFR1518_NFRX(value)              (ETH_TBFR1518_NFRX_Msk & (_UINT32_(value) << ETH_TBFR1518_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TBFR1518 register */
#define ETH_TBFR1518_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFR1518) Register Mask  */


/* -------- ETH_TMXBFR : (ETH Offset: 0x1180) ( R/ 32) 1519 to Maximum Byte Frames Received Register -------- */
#define ETH_TMXBFR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TMXBFR) 1519 to Maximum Byte Frames Received Register  Reset Value */

#define ETH_TMXBFR_NFRX_Pos                   _UINT32_(0)                                          /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received without Error Position */
#define ETH_TMXBFR_NFRX_Msk                   (_UINT32_(0xFFFFFFFF) << ETH_TMXBFR_NFRX_Pos)        /* (ETH_TMXBFR) 1519 to Maximum Byte Frames Received without Error Mask */
#define ETH_TMXBFR_NFRX(value)                (ETH_TMXBFR_NFRX_Msk & (_UINT32_(value) << ETH_TMXBFR_NFRX_Pos)) /* Assigment of value for NFRX in the ETH_TMXBFR register */
#define ETH_TMXBFR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_TMXBFR) Register Mask  */


/* -------- ETH_UFR : (ETH Offset: 0x1184) ( R/ 32) Undersize Frames Received Register -------- */
#define ETH_UFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_UFR) Undersize Frames Received Register  Reset Value */

#define ETH_UFR_UFRX_Pos                      _UINT32_(0)                                          /* (ETH_UFR) Undersize Frames Received Position */
#define ETH_UFR_UFRX_Msk                      (_UINT32_(0x3FF) << ETH_UFR_UFRX_Pos)                /* (ETH_UFR) Undersize Frames Received Mask */
#define ETH_UFR_UFRX(value)                   (ETH_UFR_UFRX_Msk & (_UINT32_(value) << ETH_UFR_UFRX_Pos)) /* Assigment of value for UFRX in the ETH_UFR register */
#define ETH_UFR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_UFR) Register Mask  */


/* -------- ETH_OFR : (ETH Offset: 0x1188) ( R/ 32) Oversize Frames Received Register -------- */
#define ETH_OFR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_OFR) Oversize Frames Received Register  Reset Value */

#define ETH_OFR_OFRX_Pos                      _UINT32_(0)                                          /* (ETH_OFR) Oversized Frames Received Position */
#define ETH_OFR_OFRX_Msk                      (_UINT32_(0x3FF) << ETH_OFR_OFRX_Pos)                /* (ETH_OFR) Oversized Frames Received Mask */
#define ETH_OFR_OFRX(value)                   (ETH_OFR_OFRX_Msk & (_UINT32_(value) << ETH_OFR_OFRX_Pos)) /* Assigment of value for OFRX in the ETH_OFR register */
#define ETH_OFR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_OFR) Register Mask  */


