Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/eth.h
/* -------- ETH_TCE : (ETH Offset: 0x11AC) ( R/ 32) TCP Checksum Errors Register -------- */
#define ETH_TCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TCE) TCP Checksum Errors Register  Reset Value */

#define ETH_TCE_TCKER_Pos                     _UINT32_(0)                                          /* (ETH_TCE) TCP Checksum Errors Position */
#define ETH_TCE_TCKER_Msk                     (_UINT32_(0xFF) << ETH_TCE_TCKER_Pos)                /* (ETH_TCE) TCP Checksum Errors Mask */
#define ETH_TCE_TCKER(value)                  (ETH_TCE_TCKER_Msk & (_UINT32_(value) << ETH_TCE_TCKER_Pos)) /* Assigment of value for TCKER in the ETH_TCE register */
#define ETH_TCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_TCE) Register Mask  */


/* -------- ETH_UCE : (ETH Offset: 0x11B0) ( R/ 32) UDP Checksum Errors Register -------- */
#define ETH_UCE_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_UCE) UDP Checksum Errors Register  Reset Value */

#define ETH_UCE_UCKER_Pos                     _UINT32_(0)                                          /* (ETH_UCE) UDP Checksum Errors Position */
#define ETH_UCE_UCKER_Msk                     (_UINT32_(0xFF) << ETH_UCE_UCKER_Pos)                /* (ETH_UCE) UDP Checksum Errors Mask */
#define ETH_UCE_UCKER(value)                  (ETH_UCE_UCKER_Msk & (_UINT32_(value) << ETH_UCE_UCKER_Pos)) /* Assigment of value for UCKER in the ETH_UCE register */
#define ETH_UCE_Msk                           _UINT32_(0x000000FF)                                 /* (ETH_UCE) Register Mask  */


/* -------- ETH_TISUBN : (ETH Offset: 0x11BC) (R/W 32) 1588 Timer Increment [15:0] Sub-Nanoseconds Register -------- */
#define ETH_TISUBN_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TISUBN) 1588 Timer Increment [15:0] Sub-Nanoseconds Register  Reset Value */

#define ETH_TISUBN_LSBTIR_Pos                 _UINT32_(0)                                          /* (ETH_TISUBN) Lower Significant Bits of Timer Increment Position */
#define ETH_TISUBN_LSBTIR_Msk                 (_UINT32_(0xFFFF) << ETH_TISUBN_LSBTIR_Pos)          /* (ETH_TISUBN) Lower Significant Bits of Timer Increment Mask */
#define ETH_TISUBN_LSBTIR(value)              (ETH_TISUBN_LSBTIR_Msk & (_UINT32_(value) << ETH_TISUBN_LSBTIR_Pos)) /* Assigment of value for LSBTIR in the ETH_TISUBN register */
#define ETH_TISUBN_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_TISUBN) Register Mask  */


/* -------- ETH_TSH : (ETH Offset: 0x11C0) (R/W 32) 1588 Timer Seconds High [15:0] Register -------- */
#define ETH_TSH_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSH) 1588 Timer Seconds High [15:0] Register  Reset Value */

#define ETH_TSH_TCS_Pos                       _UINT32_(0)                                          /* (ETH_TSH) Timer Count in Seconds Position */
#define ETH_TSH_TCS_Msk                       (_UINT32_(0xFFFF) << ETH_TSH_TCS_Pos)                /* (ETH_TSH) Timer Count in Seconds Mask */
#define ETH_TSH_TCS(value)                    (ETH_TSH_TCS_Msk & (_UINT32_(value) << ETH_TSH_TCS_Pos)) /* Assigment of value for TCS in the ETH_TSH register */
#define ETH_TSH_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_TSH) Register Mask  */


/* -------- ETH_TSSSL : (ETH Offset: 0x11C8) (R/W 32) 1588 Timer Sync Strobe Seconds [31:0] Register -------- */
#define ETH_TSSSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TSSSL) 1588 Timer Sync Strobe Seconds [31:0] Register  Reset Value */

#define ETH_TSSSL_VTS_Pos                     _UINT32_(0)                                          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Position */
#define ETH_TSSSL_VTS_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_TSSSL_VTS_Pos)          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Mask */
#define ETH_TSSSL_VTS(value)                  (ETH_TSSSL_VTS_Msk & (_UINT32_(value) << ETH_TSSSL_VTS_Pos)) /* Assigment of value for VTS in the ETH_TSSSL register */
#define ETH_TSSSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSSSL) Register Mask  */


/* -------- ETH_TSSN : (ETH Offset: 0x11CC) (R/W 32) 1588 Timer Sync Strobe Nanoseconds Register -------- */
#define ETH_TSSN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_TSSN) 1588 Timer Sync Strobe Nanoseconds Register  Reset Value */

#define ETH_TSSN_VTN_Pos                      _UINT32_(0)                                          /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Position */
#define ETH_TSSN_VTN_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_TSSN_VTN_Pos)           /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Mask */
#define ETH_TSSN_VTN(value)                   (ETH_TSSN_VTN_Msk & (_UINT32_(value) << ETH_TSSN_VTN_Pos)) /* Assigment of value for VTN in the ETH_TSSN register */
#define ETH_TSSN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_TSSN) Register Mask  */


/* -------- ETH_TSL : (ETH Offset: 0x11D0) (R/W 32) 1588 Timer Seconds [31:0] Register -------- */
#define ETH_TSL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSL) 1588 Timer Seconds [31:0] Register  Reset Value */

#define ETH_TSL_TCS_Pos                       _UINT32_(0)                                          /* (ETH_TSL) Timer Count in Seconds Position */
#define ETH_TSL_TCS_Msk                       (_UINT32_(0xFFFFFFFF) << ETH_TSL_TCS_Pos)            /* (ETH_TSL) Timer Count in Seconds Mask */
#define ETH_TSL_TCS(value)                    (ETH_TSL_TCS_Msk & (_UINT32_(value) << ETH_TSL_TCS_Pos)) /* Assigment of value for TCS in the ETH_TSL register */
#define ETH_TSL_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSL) Register Mask  */


/* -------- ETH_TN : (ETH Offset: 0x11D4) (R/W 32) 1588 Timer Nanoseconds Register -------- */
#define ETH_TN_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TN) 1588 Timer Nanoseconds Register  Reset Value */

